{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "mode": "ave", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Convolution3D", "config": {"name": "convolution3d_1", "trainable": true, "batch_input_shape": [null, 32, 32, 10, 3], "input_dtype": "float32", "nb_filter": 32, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_2", "trainable": true, "nb_filter": 32, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_1", "trainable": true, "pool_size": [3, 3, 3], "border_mode": "same", "strides": [3, 3, 3], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.25}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_3", "trainable": true, "nb_filter": 64, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_4", "trainable": true, "nb_filter": 64, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_2", "trainable": true, "pool_size": [3, 3, 3], "border_mode": "same", "strides": [3, 3, 3], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "batch_input_shape": [null, 2048], "input_dtype": "float32", "output_dim": 512, "init": "normal", "activation": "relu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 2048}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "batch_input_shape": [null, 512], "input_dtype": "float32", "output_dim": 101, "init": "normal", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 512}}]}, {"class_name": "Sequential", "config": [{"class_name": "Convolution3D", "config": {"name": "convolution3d_5", "trainable": true, "batch_input_shape": [null, 32, 32, 10, 3], "input_dtype": "float32", "nb_filter": 32, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_6", "trainable": true, "nb_filter": 32, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_3", "trainable": true, "pool_size": [3, 3, 3], "border_mode": "same", "strides": [3, 3, 3], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.25}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_7", "trainable": true, "nb_filter": 64, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_8", "trainable": true, "nb_filter": 64, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_4", "trainable": true, "pool_size": [3, 3, 3], "border_mode": "same", "strides": [3, 3, 3], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "batch_input_shape": [null, 2048], "input_dtype": "float32", "output_dim": 512, "init": "normal", "activation": "relu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 2048}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "batch_input_shape": [null, 512], "input_dtype": "float32", "output_dim": 101, "init": "normal", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 512}}]}, {"class_name": "Sequential", "config": [{"class_name": "Convolution3D", "config": {"name": "convolution3d_9", "trainable": true, "batch_input_shape": [null, 32, 32, 10, 3], "input_dtype": "float32", "nb_filter": 32, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_10", "trainable": true, "nb_filter": 32, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_5", "trainable": true, "pool_size": [3, 3, 3], "border_mode": "same", "strides": [3, 3, 3], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "p": 0.25}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_11", "trainable": true, "nb_filter": 64, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_12", "trainable": true, "nb_filter": 64, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_6", "trainable": true, "pool_size": [3, 3, 3], "border_mode": "same", "strides": [3, 3, 3], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "batch_input_shape": [null, 2048], "input_dtype": "float32", "output_dim": 512, "init": "normal", "activation": "relu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 2048}}, {"class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "batch_input_shape": [null, 512], "input_dtype": "float32", "output_dim": 101, "init": "normal", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 512}}]}, {"class_name": "Sequential", "config": [{"class_name": "Convolution3D", "config": {"name": "convolution3d_13", "trainable": true, "batch_input_shape": [null, 32, 32, 10, 3], "input_dtype": "float32", "nb_filter": 32, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_14", "trainable": true, "nb_filter": 32, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_7", "trainable": true, "pool_size": [3, 3, 3], "border_mode": "same", "strides": [3, 3, 3], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_10", "trainable": true, "p": 0.25}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_15", "trainable": true, "nb_filter": 64, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_16", "trainable": true, "nb_filter": 64, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_8", "trainable": true, "pool_size": [3, 3, 3], "border_mode": "same", "strides": [3, 3, 3], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_11", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "batch_input_shape": [null, 2048], "input_dtype": "float32", "output_dim": 512, "init": "normal", "activation": "relu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 2048}}, {"class_name": "Dropout", "config": {"name": "dropout_12", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "batch_input_shape": [null, 512], "input_dtype": "float32", "output_dim": 101, "init": "normal", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 512}}]}, {"class_name": "Sequential", "config": [{"class_name": "Convolution3D", "config": {"name": "convolution3d_17", "trainable": true, "batch_input_shape": [null, 32, 32, 10, 3], "input_dtype": "float32", "nb_filter": 32, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_18", "trainable": true, "nb_filter": 32, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_9", "trainable": true, "pool_size": [3, 3, 3], "border_mode": "same", "strides": [3, 3, 3], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_13", "trainable": true, "p": 0.25}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_19", "trainable": true, "nb_filter": 64, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_20", "trainable": true, "nb_filter": 64, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_10", "trainable": true, "pool_size": [3, 3, 3], "border_mode": "same", "strides": [3, 3, 3], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_14", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_5", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "batch_input_shape": [null, 2048], "input_dtype": "float32", "output_dim": 512, "init": "normal", "activation": "relu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 2048}}, {"class_name": "Dropout", "config": {"name": "dropout_15", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "batch_input_shape": [null, 512], "input_dtype": "float32", "output_dim": 101, "init": "normal", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 512}}]}, {"class_name": "Sequential", "config": [{"class_name": "Convolution3D", "config": {"name": "convolution3d_21", "trainable": true, "batch_input_shape": [null, 32, 32, 10, 3], "input_dtype": "float32", "nb_filter": 32, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_22", "trainable": true, "nb_filter": 32, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_11", "trainable": true, "pool_size": [3, 3, 3], "border_mode": "same", "strides": [3, 3, 3], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_16", "trainable": true, "p": 0.25}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_23", "trainable": true, "nb_filter": 64, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_24", "trainable": true, "nb_filter": 64, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_12", "trainable": true, "pool_size": [3, 3, 3], "border_mode": "same", "strides": [3, 3, 3], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_17", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_6", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "batch_input_shape": [null, 2048], "input_dtype": "float32", "output_dim": 512, "init": "normal", "activation": "relu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 2048}}, {"class_name": "Dropout", "config": {"name": "dropout_18", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "batch_input_shape": [null, 512], "input_dtype": "float32", "output_dim": 101, "init": "normal", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 512}}]}, {"class_name": "Sequential", "config": [{"class_name": "Convolution3D", "config": {"name": "convolution3d_25", "trainable": true, "batch_input_shape": [null, 32, 32, 10, 3], "input_dtype": "float32", "nb_filter": 32, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_26", "trainable": true, "nb_filter": 32, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_13", "trainable": true, "pool_size": [3, 3, 3], "border_mode": "same", "strides": [3, 3, 3], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_19", "trainable": true, "p": 0.25}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_27", "trainable": true, "nb_filter": 64, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_28", "trainable": true, "nb_filter": 64, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_14", "trainable": true, "pool_size": [3, 3, 3], "border_mode": "same", "strides": [3, 3, 3], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_20", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_7", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "batch_input_shape": [null, 2048], "input_dtype": "float32", "output_dim": 512, "init": "normal", "activation": "relu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 2048}}, {"class_name": "Dropout", "config": {"name": "dropout_21", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "batch_input_shape": [null, 512], "input_dtype": "float32", "output_dim": 101, "init": "normal", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 512}}]}, {"class_name": "Sequential", "config": [{"class_name": "Convolution3D", "config": {"name": "convolution3d_29", "trainable": true, "batch_input_shape": [null, 32, 32, 10, 3], "input_dtype": "float32", "nb_filter": 32, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_30", "trainable": true, "nb_filter": 32, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_15", "trainable": true, "pool_size": [3, 3, 3], "border_mode": "same", "strides": [3, 3, 3], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_22", "trainable": true, "p": 0.25}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_31", "trainable": true, "nb_filter": 64, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_32", "trainable": true, "nb_filter": 64, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_16", "trainable": true, "pool_size": [3, 3, 3], "border_mode": "same", "strides": [3, 3, 3], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_23", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_8", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "batch_input_shape": [null, 2048], "input_dtype": "float32", "output_dim": 512, "init": "normal", "activation": "relu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 2048}}, {"class_name": "Dropout", "config": {"name": "dropout_24", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "batch_input_shape": [null, 512], "input_dtype": "float32", "output_dim": 101, "init": "normal", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 512}}]}, {"class_name": "Sequential", "config": [{"class_name": "Convolution3D", "config": {"name": "convolution3d_33", "trainable": true, "batch_input_shape": [null, 32, 32, 10, 3], "input_dtype": "float32", "nb_filter": 32, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_34", "trainable": true, "nb_filter": 32, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_17", "trainable": true, "pool_size": [3, 3, 3], "border_mode": "same", "strides": [3, 3, 3], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_25", "trainable": true, "p": 0.25}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_35", "trainable": true, "nb_filter": 64, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_36", "trainable": true, "nb_filter": 64, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_18", "trainable": true, "pool_size": [3, 3, 3], "border_mode": "same", "strides": [3, 3, 3], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_26", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_9", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_17", "trainable": true, "batch_input_shape": [null, 2048], "input_dtype": "float32", "output_dim": 512, "init": "normal", "activation": "relu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 2048}}, {"class_name": "Dropout", "config": {"name": "dropout_27", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_18", "trainable": true, "batch_input_shape": [null, 512], "input_dtype": "float32", "output_dim": 101, "init": "normal", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 512}}]}, {"class_name": "Sequential", "config": [{"class_name": "Convolution3D", "config": {"name": "convolution3d_37", "trainable": true, "batch_input_shape": [null, 32, 32, 10, 3], "input_dtype": "float32", "nb_filter": 32, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_38", "trainable": true, "nb_filter": 32, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_19", "trainable": true, "pool_size": [3, 3, 3], "border_mode": "same", "strides": [3, 3, 3], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_28", "trainable": true, "p": 0.25}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_39", "trainable": true, "nb_filter": 64, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_40", "trainable": true, "nb_filter": 64, "kernel_dim1": 3, "kernel_dim2": 3, "kernel_dim3": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1, 1], "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_20", "trainable": true, "pool_size": [3, 3, 3], "border_mode": "same", "strides": [3, 3, 3], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_29", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_10", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_19", "trainable": true, "batch_input_shape": [null, 2048], "input_dtype": "float32", "output_dim": 512, "init": "normal", "activation": "relu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 2048}}, {"class_name": "Dropout", "config": {"name": "dropout_30", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_20", "trainable": true, "batch_input_shape": [null, 512], "input_dtype": "float32", "output_dim": 101, "init": "normal", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 512}}]}]}}, {"class_name": "Dense", "config": {"name": "dense_24", "trainable": true, "output_dim": 8, "init": "glorot_uniform", "activation": "softmax", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 101}}], "keras_version": "1.2.0"}